In [1]:
import numpy as np
import pandas as pd

In [56]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [7]:
date['date'] = pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## Extract Year

In [11]:
date['date_year'] = date['date'].dt.year

In [12]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

## Extract Month

In [13]:
date['date_month'] = date['date'].dt.month

In [14]:
date.head(2)

        date  product_id  city_id  orders  date_year  date_month
0 2019-12-10        5628       25       3       2019          12
1 2018-08-15        3646       14     157       2018           8

In [16]:
date['date_month_name'] = date['date'].dt.month_name()

In [18]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [22]:
date['date_dow_name'] = date['date'].dt.day_name()

In [23]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,Saturday
4,2019-01-06,4344,25,3,2019,1,January,Sunday

In [24]:
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

In [26]:
date['date_is_weekend1'] = date['date_dow_name'].apply(lambda x: 1 if x in ['Sunday','Saturday'] else 0)

In [27]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_dow_name,date_is_weekend,date_is_weekend1
0,2019-12-10,5628,25,3,2019,12,December,Tuesday,0,0
1,2018-08-15,3646,14,157,2018,8,August,Wednesday,0,0
2,2018-10-23,1859,25,1,2018,10,October,Tuesday,0,0
3,2019-08-17,7292,25,1,2019,8,August,Saturday,1,1
4,2019-01-06,4344,25,3,2019,1,January,Sunday,1,1

In [31]:
date['date_week'] = date['date'].dt.week

AttributeError: 'DatetimeProperties' object has no attribute 'week'

In [33]:
date['quarter'] = date['date'].dt.quarter

In [34]:
date

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_dow_name,date_is_weekend,date_is_weekend1,quarter
0,2019-12-10,5628,25,3,2019,12,December,Tuesday,0,0,4
1,2018-08-15,3646,14,157,2018,8,August,Wednesday,0,0,3
2,2018-10-23,1859,25,1,2018,10,October,Tuesday,0,0,4
3,2019-08-17,7292,25,1,2019,8,August,Saturday,1,1,3
4,2019-01-06,4344,25,3,2019,1,January,Sunday,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,10,October,Monday,0,0,4
996,2018-12-06,5521,7,1,2018,12,December,Thursday,0,0,4
997,2019-05-07,487,26,14,2019,5,May,Tuesday,0,0,2
998,2019-03-03,1503,21,2,2019,3,March,Sunday,1,1,1
999,2019-10-15,6371,7,22,2019,10,October,Tuesday,0,0,4

In [36]:
import datetime
today= datetime.datetime.today()

In [37]:
today

datetime.datetime(2024, 11, 27, 12, 15, 48, 565102)

In [38]:
today - date['date']

0     1814 days 12:15:48.565102
1     2296 days 12:15:48.565102
2     2227 days 12:15:48.565102
3     1929 days 12:15:48.565102
4     2152 days 12:15:48.565102
                 ...
995   2242 days 12:15:48.565102
996   2183 days 12:15:48.565102
997   2031 days 12:15:48.565102
998   2096 days 12:15:48.565102
999   1870 days 12:15:48.565102
Name: date, Length: 1000, dtype: timedelta64[ns]

In [47]:
(today - date['date']).dt.days

0      1814
1      2296
2      2227
3      1929
4      2152
       ...
995    2242
996    2183
997    2031
998    2096
999    1870
Name: date, Length: 1000, dtype: int64

In [57]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [58]:
time['date'] = pd.to_datetime(time['date'])

In [59]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [60]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [61]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [50]:
time['time'] = time['date'].dt.time

In [62]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [63]:
(today - time['date'])

0     4000 days 11:25:48.565102
1     3864 days 12:35:48.565102
2     4350 days 11:54:48.565102
3     3652 days 11:44:48.565102
4     4049 days 13:04:48.565102
                 ...
995   4639 days 11:25:48.565102
996   3960 days 13:01:48.565102
997   4425 days 12:38:48.565102
998   4541 days 12:41:48.565102
999   3813 days 12:50:48.565102
Name: date, Length: 1000, dtype: timedelta64[ns]

In [64]:
(today - time['date']).dt.days

0      4000
1      3864
2      4350
3      3652
4      4049
       ...
995    4639
996    3960
997    4425
998    4541
999    3813
Name: date, Length: 1000, dtype: int64

In [70]:
(today - time['date'])/np.timedelta64(1,'h')

0       96011.430157
1       92748.596824
2      104411.913490
3       87659.746824
4       97189.080157
           ...
995    111347.430157
996     95053.030157
997    106212.646824
998    108996.696824
999     91524.846824
Name: date, Length: 1000, dtype: float64